<?xml version="1.0" ?>
<net name="nanodet_m" version="10">
	<layers>
		<layer id="0" name="input.1" type="Parameter" version="opset1">
			<data shape="1, 3, 416, 416" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="input.1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="data_mul_1007924210" type="Const" version="opset1">
			<data element_type="f16" shape="1, 3, 1, 1" offset="0" size="6"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="input.1/scale/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="data_add_1008123667" type="Const" version="opset1">
			<data element_type="f16" shape="1, 3, 1, 1" offset="6" size="6"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="input.1/mean/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="941" type="Const" version="opset1">
			<data element_type="f16" shape="24, 3, 3, 3" offset="12" size="1296"/>
			<output>
				<port id="0" precision="FP16" names="941">
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Conv_0/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Conv_0/Dims5487" type="Const" version="opset1">
			<data element_type="f16" shape="1, 24, 1, 1" offset="1308" size="48"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Conv_0" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="940">
					<dim>1</dim>
					<dim>24</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="LeakyRelu_1/weights1532123952" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="1356" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="LeakyRelu_1" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="424">
					<dim>1</dim>
					<dim>24</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="MaxPool_2" type="MaxPool" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" kernel="3, 3" rounding_type="floor" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="425">
					<dim>1</dim>
					<dim>24</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="944" type="Const" version="opset1">
			<data element_type="f16" shape="24, 1, 1, 3, 3" offset="1360" size="432"/>
			<output>
				<port id="0" precision="FP16" names="944">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Conv_3/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Conv_3/Dims5481" type="Const" version="opset1">
			<data element_type="f16" shape="1, 24, 1, 1" offset="1792" size="48"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Conv_3" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="943">
					<dim>1</dim>
					<dim>24</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="947" type="Const" version="opset1">
			<data element_type="f16" shape="58, 24, 1, 1" offset="1840" size="2784"/>
			<output>
				<port id="0" precision="FP16" names="947">
					<dim>58</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Conv_4/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>58</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Conv_4/Dims5613" type="Const" version="opset1">
			<data element_type="f16" shape="1, 58, 1, 1" offset="4624" size="116"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Conv_4" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="946">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="LeakyRelu_5/weights1531723724" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="1356" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="LeakyRelu_5" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="430">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="950" type="Const" version="opset1">
			<data element_type="f16" shape="58, 24, 1, 1" offset="4740" size="2784"/>
			<output>
				<port id="0" precision="FP16" names="950">
					<dim>58</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Conv_6/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>58</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Conv_6/Dims5337" type="Const" version="opset1">
			<data element_type="f16" shape="1, 58, 1, 1" offset="7524" size="116"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Conv_6" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="949">
					<dim>1</dim>
					<dim>58</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="LeakyRelu_7/weights1527324033" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="1356" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="LeakyRelu_7" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="433">
					<dim>1</dim>
					<dim>58</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="953" type="Const" version="opset1">
			<data element_type="f16" shape="58, 1, 1, 3, 3" offset="7640" size="1044"/>
			<output>
				<port id="0" precision="FP16" names="953">
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Conv_8/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Conv_8/Dims5367" type="Const" version="opset1">
			<data element_type="f16" shape="1, 58, 1, 1" offset="8684" size="116"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Conv_8" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="952">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="956" type="Const" version="opset1">
			<data element_type="f16" shape="58, 58, 1, 1" offset="8800" size="6728"/>
			<output>
				<port id="0" precision="FP16" names="956">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Conv_9/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Conv_9/Dims5439" type="Const" version="opset1">
			<data element_type="f16" shape="1, 58, 1, 1" offset="15528" size="116"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Conv_9" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="955">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="LeakyRelu_10/weights1537723904" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="1356" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="LeakyRelu_10" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="438">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Concat_11" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="439">
					<dim>1</dim>
					<dim>116</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="44024102" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="15644" size="40"/>
			<output>
				<port id="0" precision="I64" names="440">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Reshape_13" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>116</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="441">
					<dim>1</dim>
					<dim>2</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="464" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="15684" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Transpose_14" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="442">
					<dim>1</dim>
					<dim>58</dim>
					<dim>2</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="443" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="15724" size="32"/>
			<output>
				<port id="0" precision="I64" names="443">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Reshape_16" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>2</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="444">
					<dim>1</dim>
					<dim>116</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="759924081" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="15756" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="46" name="760124009" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="15764" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Slice_27/Split" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>116</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16" names="455">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="4" precision="FP16" names="458">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="959" type="Const" version="opset1">
			<data element_type="f16" shape="58, 58, 1, 1" offset="15780" size="6728"/>
			<output>
				<port id="0" precision="FP16" names="959">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Conv_31/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Conv_31/Dims5541" type="Const" version="opset1">
			<data element_type="f16" shape="1, 58, 1, 1" offset="22508" size="116"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Conv_31" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="958">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="LeakyRelu_32/weights1535724117" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="1356" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="LeakyRelu_32" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="461">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="962" type="Const" version="opset1">
			<data element_type="f16" shape="58, 1, 1, 3, 3" offset="22624" size="1044"/>
			<output>
				<port id="0" precision="FP16" names="962">
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Conv_33/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Conv_33/Dims5529" type="Const" version="opset1">
			<data element_type="f16" shape="1, 58, 1, 1" offset="23668" size="116"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Conv_33" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="961">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="965" type="Const" version="opset1">
			<data element_type="f16" shape="58, 58, 1, 1" offset="23784" size="6728"/>
			<output>
				<port id="0" precision="FP16" names="965">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Conv_34/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Conv_34/Dims5415" type="Const" version="opset1">
			<data element_type="f16" shape="1, 58, 1, 1" offset="30512" size="116"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Conv_34" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="964">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="LeakyRelu_35/weights1536924048" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="1356" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="LeakyRelu_35" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="466">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Concat_36" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="467">
					<dim>1</dim>
					<dim>116</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="440" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="15644" size="40"/>
			<output>
				<port id="0" precision="I64" names="440">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Reshape_38" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>116</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="469">
					<dim>1</dim>
					<dim>2</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="437" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="15684" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Transpose_39" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="470">
					<dim>1</dim>
					<dim>58</dim>
					<dim>2</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="44323832" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="15724" size="32"/>
			<output>
				<port id="0" precision="I64" names="443">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Reshape_41" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>2</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="472">
					<dim>1</dim>
					<dim>116</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="760424129" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="15756" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="72" name="760623913" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="15764" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Slice_52/Split" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>116</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16" names="483">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="4" precision="FP16" names="486">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="968" type="Const" version="opset1">
			<data element_type="f16" shape="58, 58, 1, 1" offset="30628" size="6728"/>
			<output>
				<port id="0" precision="FP16" names="968">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Conv_56/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Conv_56/Dims5391" type="Const" version="opset1">
			<data element_type="f16" shape="1, 58, 1, 1" offset="37356" size="116"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Conv_56" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="967">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="LeakyRelu_57/weights1532923871" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="1356" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="LeakyRelu_57" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="489">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="971" type="Const" version="opset1">
			<data element_type="f16" shape="58, 1, 1, 3, 3" offset="37472" size="1044"/>
			<output>
				<port id="0" precision="FP16" names="971">
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Conv_58/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Conv_58/Dims5379" type="Const" version="opset1">
			<data element_type="f16" shape="1, 58, 1, 1" offset="38516" size="116"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Conv_58" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="970">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="974" type="Const" version="opset1">
			<data element_type="f16" shape="58, 58, 1, 1" offset="38632" size="6728"/>
			<output>
				<port id="0" precision="FP16" names="974">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Conv_59/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Conv_59/Dims5421" type="Const" version="opset1">
			<data element_type="f16" shape="1, 58, 1, 1" offset="45360" size="116"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Conv_59" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="973">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="LeakyRelu_60/weights1521724099" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="1356" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="LeakyRelu_60" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="494">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Concat_61" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="495">
					<dim>1</dim>
					<dim>116</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="44024003" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="15644" size="40"/>
			<output>
				<port id="0" precision="I64" names="440">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Reshape_63" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>116</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="497">
					<dim>1</dim>
					<dim>2</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="445" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="15684" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Transpose_64" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="498">
					<dim>1</dim>
					<dim>58</dim>
					<dim>2</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="44324087" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="15724" size="32"/>
			<output>
				<port id="0" precision="I64" names="443">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Reshape_66" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>2</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="500">
					<dim>1</dim>
					<dim>116</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="760923466" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="15756" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="98" name="761124072" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="15764" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Slice_77/Split" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>116</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16" names="511">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="4" precision="FP16" names="514">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="977" type="Const" version="opset1">
			<data element_type="f16" shape="58, 58, 1, 1" offset="45476" size="6728"/>
			<output>
				<port id="0" precision="FP16" names="977">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Conv_81/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Conv_81/Dims5679" type="Const" version="opset1">
			<data element_type="f16" shape="1, 58, 1, 1" offset="52204" size="116"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Conv_81" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="976">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="LeakyRelu_82/weights1525323499" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="1356" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="LeakyRelu_82" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="517">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="980" type="Const" version="opset1">
			<data element_type="f16" shape="58, 1, 1, 3, 3" offset="52320" size="1044"/>
			<output>
				<port id="0" precision="FP16" names="980">
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Conv_83/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Conv_83/Dims5583" type="Const" version="opset1">
			<data element_type="f16" shape="1, 58, 1, 1" offset="53364" size="116"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Conv_83" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="979">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="983" type="Const" version="opset1">
			<data element_type="f16" shape="58, 58, 1, 1" offset="53480" size="6728"/>
			<output>
				<port id="0" precision="FP16" names="983">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Conv_84/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Conv_84/Dims5445" type="Const" version="opset1">
			<data element_type="f16" shape="1, 58, 1, 1" offset="60208" size="116"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Conv_84" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="982">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="LeakyRelu_85/weights1527724312" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="1356" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="LeakyRelu_85" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="522">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Concat_86" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="523">
					<dim>1</dim>
					<dim>116</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="44024288" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="15644" size="40"/>
			<output>
				<port id="0" precision="I64" names="440">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Reshape_88" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>116</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="525">
					<dim>1</dim>
					<dim>2</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="462" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="15684" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Transpose_89" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
					<dim>58</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="526">
					<dim>1</dim>
					<dim>58</dim>
					<dim>2</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="44324024" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="15724" size="32"/>
			<output>
				<port id="0" precision="I64" names="443">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="Reshape_91" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>58</dim>
					<dim>2</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="528">
					<dim>1</dim>
					<dim>116</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="986" type="Const" version="opset1">
